SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy7.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7.menu.bodvoltage.2v1=2.1V
atxy7.menu.bodvoltage.2v9=2.9V
atxy7.menu.bodvoltage.3v3=3.3V
atxy7.menu.bodvoltage.3v7=3.7V
atxy7.menu.bodvoltage.4v0=4.0V
atxy7.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy7.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7.menu.bodvoltage.2v1.bootloader.bodlevbits=001

atxy7.menu.bodmode.disabled=Disabled/Disabled
atxy7.menu.bodmode.enabled=Enabled/Enabled
atxy7.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy7.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy7.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy7.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy7.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy7.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy7.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy7.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy7.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy7.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy7.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy7.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy7.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy7.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy7.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy7.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy7.menu.eesave.enable=EEPROM retained
atxy7.menu.eesave.enable.bootloader.eesavebit=1
atxy7.menu.eesave.disable=EEPROM not retained
atxy7.menu.eesave.disable.bootloader.eesavebit=0

atxy7.menu.millis.enabled=Enabled (default timer)
atxy7.menu.millis.disabled=Disabled (saves flash)
atxy7.menu.millis.timera=TCA0 (default on 0-series)
atxy7.menu.millis.timerd=TCD0 (1-series only, default there)
atxy7.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy7.menu.millis.timerb1=TCB1 (3217,1617, 2-series only)
atxy7.menu.millis.rtc=RTC (no micros)
atxy7.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy7.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
atxy7.menu.millis.disabled.build.millistimer=NONE
atxy7.menu.millis.timera.build.millistimer=A0
atxy7.menu.millis.timerd.build.millistimer=D0
atxy7.menu.millis.timerb0.build.millistimer=B0
atxy7.menu.millis.timerb1.build.millistimer=B1
atxy7.menu.millis.rtc.build.millistimer=RTC
atxy7.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy7.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

atxy7.menu.resetpin.UPDI=UPDI (no reset pin)
atxy7.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy7.menu.resetpin.UPDIaltrst=UPDI w/reset on PB4 (2-series only)
atxy7.menu.resetpin.UPDIaltrst.bootloader.resetpinbits={bootloader.altreset}
atxy7.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
atxy7.menu.resetpin.reset.bootloader.resetpinbits=10
atxy7.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
atxy7.menu.resetpin.gpio.bootloader.resetpinbits=00

atxy7.menu.startuptime.8=8ms
atxy7.menu.startuptime.0=0ms
atxy7.menu.startuptime.1=1ms
atxy7.menu.startuptime.2=2ms
atxy7.menu.startuptime.4=4ms
atxy7.menu.startuptime.16=16ms
atxy7.menu.startuptime.32=32ms
atxy7.menu.startuptime.64=64ms
atxy7.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy7.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy7.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy7.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy7.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy7.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy7.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy7.menu.startuptime.64.bootloader.SYSCFG1=0x07

atxy7.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
atxy7.menu.uartvoltage.skip.build.uartvoltage=NA
atxy7.menu.uartvoltage.5v=Closer to 5v
atxy7.menu.uartvoltage.3v=Closer to 3v
atxy7.menu.uartvoltage.5v.build.uartvoltage=5V
atxy7.menu.uartvoltage.3v.build.uartvoltage=3V

atxy7.upload.tool=avrdude

atxy7.build.core=megatinycore
atxy7.build.variant=txy7
atxy7.build.text_section_start=.text=0x0
atxy7.build.extra_flags=-DARDUINO_attinyxy7 {build.millis} -DUARTBAUD{build.uartvoltage}
atxy7.build.export_merged_output=false

atxy7.bootloader.tool=avrdude
atxy7.bootloader.WDTCFG=0x00
atxy7.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy7.bootloader.OSCCFG=0x01
atxy7.bootloader.TCD0CFG=0x00
atxy7.bootloader.APPEND=0x00
atxy7.bootloader.BOOTEND=0x00
atxy7.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy7.bootloader.avrdudestring=
atxy7.bootloader.pymcuprogstring=-aerase

##########################################################################
#      ATtiny3226/3216/1626/1616/1606/826/816/806/426/416/406
##########################################################################

atxy6.upload.workaround=
atxy6.build.millistimer=D0
atxy6.build.bootload=
atxy6.build.board=AVR_ATtinyxy6
atxy6.build.core=megatinycore
atxy6.build.mcu=attiny{build.attiny}
atxy6.build.serialeventabr=
atxy6.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy6.build.f_cpu={build.speed}000000L
atxy6.bootloader.altreset=Only supported for 2-series parts

atxy6.build.extra_flags=-DARDUINO_attinyxy6 {build.millis} -DUARTBAUD{build.uartvoltage}
atxy6.build.export_merged_output=false
atxy6.build.variant=txy6
atxy6.build.text_section_start=.text=0x0

atxy6.upload.tool=avrdude

atxy6.bootloader.tool=avrdude
atxy6.bootloader.WDTCFG=0x00
atxy6.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy6.bootloader.OSCCFG=0x01
atxy6.bootloader.TCD0CFG=0x00
atxy6.bootloader.APPEND=0x00
atxy6.bootloader.BOOTEND=0x00
atxy6.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy6.bootloader.avrdudestring=
atxy6.bootloader.pymcuprogstring=-aerase

atxy6.menu.chip.3216=ATtiny3216
atxy6.menu.chip.3216.build.board=AVR_ATtiny3216
atxy6.menu.chip.3216.build.attiny=3216
atxy6.menu.chip.3216.upload.maximum_size=32768
atxy6.menu.chip.3216.upload.maximum_data_size=2048
atxy6.menu.chip.1616=ATtiny1616
atxy6.menu.chip.1616.build.board=AVR_ATtiny1616
atxy6.menu.chip.1616.build.attiny=1616
atxy6.menu.chip.1616.upload.maximum_size=16384
atxy6.menu.chip.1616.upload.maximum_data_size=2048
atxy6.menu.chip.816=ATtiny816
atxy6.menu.chip.816.build.board=AVR_ATtiny816
atxy6.menu.chip.816.build.attiny=816
atxy6.menu.chip.816.upload.maximum_size=8192
atxy6.menu.chip.816.upload.maximum_data_size=512
atxy6.menu.chip.416=ATtiny416
atxy6.menu.chip.416.build.board=AVR_ATtiny416
atxy6.menu.chip.416.build.attiny=416
atxy6.menu.chip.416.upload.maximum_size=4096
atxy6.menu.chip.416.upload.maximum_data_size=256
atxy6.menu.chip.3226=ATtiny3226
atxy6.menu.chip.3226.bootloader.altreset=11
atxy6.menu.chip.3226.build.board=AVR_ATtiny3226
atxy6.menu.chip.3226.build.millistimer=B1
atxy6.menu.chip.3226.build.attiny=3226
atxy6.menu.chip.3226.upload.maximum_size=32768
atxy6.menu.chip.3226.upload.maximum_data_size=3072
atxy6.menu.chip.1626=ATtiny1626
atxy6.menu.chip.1626.bootloader.altreset=11
atxy6.menu.chip.1626.build.board=AVR_ATtiny1626
atxy6.menu.chip.1626.build.millistimer=B1
atxy6.menu.chip.1626.build.attiny=1626
atxy6.menu.chip.1626.upload.maximum_size=16384
atxy6.menu.chip.1626.upload.maximum_data_size=2048
atxy6.menu.chip.826=ATtiny826
atxy6.menu.chip.826.bootloader.altreset=11
atxy6.menu.chip.826.build.board=AVR_ATtiny826
atxy6.menu.chip.826.build.millistimer=B1
atxy6.menu.chip.826.build.attiny=826
atxy6.menu.chip.826.upload.maximum_size=8192
atxy6.menu.chip.826.upload.maximum_data_size=1024
atxy6.menu.chip.426=ATtiny426
atxy6.menu.chip.426.bootloader.altreset=11
atxy6.menu.chip.426.build.board=AVR_ATtiny426
atxy6.menu.chip.426.build.millistimer=B1
atxy6.menu.chip.426.build.attiny=426
atxy6.menu.chip.426.upload.maximum_size=4096
atxy6.menu.chip.426.upload.maximum_data_size=512
atxy6.menu.chip.1606=ATtiny1606
atxy6.menu.chip.1606.build.board=AVR_ATtiny1606
atxy6.menu.chip.1606.build.attiny=1606
atxy6.menu.chip.1606.build.millistimer=A0
atxy6.menu.chip.1606.upload.maximum_size=16384
atxy6.menu.chip.1606.upload.maximum_data_size=1024
atxy6.menu.chip.806=ATtiny806
atxy6.menu.chip.806.build.board=AVR_ATtiny806
atxy6.menu.chip.806.build.attiny=806
atxy6.menu.chip.806.build.millistimer=A0
atxy6.menu.chip.806.upload.maximum_size=8192
atxy6.menu.chip.806.upload.maximum_data_size=512
atxy6.menu.chip.406=ATtiny406
atxy6.menu.chip.406.build.board=AVR_ATtiny406
atxy6.menu.chip.406.build.attiny=406
atxy6.menu.chip.406.build.millistimer=A0
atxy6.menu.chip.406.upload.maximum_size=4096
atxy6.menu.chip.406.upload.maximum_data_size=256

atxy6.menu.clock.20internal=20 MHz internal
atxy6.menu.clock.16internal=16 MHz internal
atxy6.menu.clock.10internal=10 MHz internal
atxy6.menu.clock.8internal=8 MHz internal
atxy6.menu.clock.5internal=5 MHz internal
atxy6.menu.clock.4internal=4 MHz internal
atxy6.menu.clock.1internal=1 MHz internal
atxy6.menu.clock.20extclock=20 MHz external clock
atxy6.menu.clock.16extclock=16 MHz external clock
atxy6.menu.clock.12extclock=12 MHz external clock
atxy6.menu.clock.10extclock=10 MHz external clock
atxy6.menu.clock.8extclock=8 MHz external clock
atxy6.menu.clock.24extclock=24 MHz external clock (overclocked)
atxy6.menu.clock.28extclock=28 MHz external clock (overclocked)
atxy6.menu.clock.32extclock=32 MHz external clock (overclocked)
atxy6.menu.clock.20internal.build.speed=20
atxy6.menu.clock.20internal.build.clocksource=0
atxy6.menu.clock.16internal.build.speed=16
atxy6.menu.clock.16internal.build.clocksource=0
atxy6.menu.clock.10internal.build.speed=10
atxy6.menu.clock.10internal.build.clocksource=0
atxy6.menu.clock.8internal.build.speed=8
atxy6.menu.clock.8internal.build.clocksource=0
atxy6.menu.clock.5internal.build.speed=5
atxy6.menu.clock.5internal.build.clocksource=0
atxy6.menu.clock.4internal.build.speed=4
atxy6.menu.clock.4internal.build.clocksource=0
atxy6.menu.clock.1internal.build.speed=1
atxy6.menu.clock.1internal.build.clocksource=0
atxy6.menu.clock.20extclock.build.speed=20
atxy6.menu.clock.20extclock.build.clocksource=2
atxy6.menu.clock.16extclock.build.speed=16
atxy6.menu.clock.16extclock.build.clocksource=2
atxy6.menu.clock.12extclock.build.speed=12
atxy6.menu.clock.12extclock.build.clocksource=2
atxy6.menu.clock.10extclock.build.speed=10
atxy6.menu.clock.10extclock.build.clocksource=2
atxy6.menu.clock.8extclock.build.speed=8
atxy6.menu.clock.8extclock.build.clocksource=2
atxy6.menu.clock.24extclock.build.speed=24
atxy6.menu.clock.24extclock.build.clocksource=2
atxy6.menu.clock.28extclock.build.speed=28
atxy6.menu.clock.28extclock.build.clocksource=2
atxy6.menu.clock.32extclock.build.speed=32
atxy6.menu.clock.32extclock.build.clocksource=2
atxy6.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy6.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy6.menu.clock.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy6.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy6.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy6.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy6.menu.bodvoltage.2v1=2.1V
atxy6.menu.bodvoltage.2v9=2.9V
atxy6.menu.bodvoltage.3v3=3.3V
atxy6.menu.bodvoltage.3v7=3.7V
atxy6.menu.bodvoltage.4v0=4.0V
atxy6.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy6.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy6.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy6.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy6.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy6.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy6.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy6.menu.bodvoltage.2v1.bootloader.bodlevbits=001

