SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy6.menu.bodmode.disabled=Disabled/Disabled
atxy6.menu.bodmode.enabled=Enabled/Enabled
atxy6.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy6.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy6.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy6.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy6.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy6.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy6.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy6.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy6.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy6.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy6.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy6.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy6.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy6.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy6.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy6.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy6.menu.eesave.enable=EEPROM retained
atxy6.menu.eesave.enable.bootloader.eesavebit=1
atxy6.menu.eesave.disable=EEPROM not retained
atxy6.menu.eesave.disable.bootloader.eesavebit=0

atxy6.menu.millis.enabled=Enabled (default timer)
atxy6.menu.millis.disabled=Disabled (saves flash)
atxy6.menu.millis.timera=TCA0 (default on 0-series)
atxy6.menu.millis.timerd=TCD0 (1-series only, default there)
atxy6.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy6.menu.millis.timerb1=TCB1 (3216, 1616, 2-series only)
atxy6.menu.millis.rtc=RTC (no micros)
atxy6.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy6.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
atxy6.menu.millis.disabled.build.millistimer=NONE
atxy6.menu.millis.timera.build.millistimer=A0
atxy6.menu.millis.timerd.build.millistimer=D0
atxy6.menu.millis.timerb0.build.millistimer=B0
atxy6.menu.millis.timerb1.build.millistimer=B1
atxy6.menu.millis.rtc.build.millistimer=RTC
atxy6.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy6.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

atxy6.menu.resetpin.UPDI=UPDI (no reset pin)
atxy6.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy6.menu.resetpin.UPDIaltrst=UPDI w/reset on PB4 (2-series only)
atxy6.menu.resetpin.UPDIaltrst.bootloader.resetpinbits={bootloader.altreset}
atxy6.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
atxy6.menu.resetpin.reset.bootloader.resetpinbits=10
atxy6.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
atxy6.menu.resetpin.gpio.bootloader.resetpinbits=00

atxy6.menu.startuptime.8=8ms
atxy6.menu.startuptime.0=0ms
atxy6.menu.startuptime.1=1ms
atxy6.menu.startuptime.2=2ms
atxy6.menu.startuptime.4=4ms
atxy6.menu.startuptime.16=16ms
atxy6.menu.startuptime.32=32ms
atxy6.menu.startuptime.64=64ms
atxy6.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy6.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy6.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy6.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy6.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy6.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy6.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy6.menu.startuptime.64.bootloader.SYSCFG1=0x07

atxy6.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
atxy6.menu.uartvoltage.skip.build.uartvoltage=NA
atxy6.menu.uartvoltage.5v=Closer to 5v
atxy6.menu.uartvoltage.3v=Closer to 3v
atxy6.menu.uartvoltage.5v.build.uartvoltage=5V
atxy6.menu.uartvoltage.3v.build.uartvoltage=3V



##########################################################################
#      ATtiny3224/1624/1614/804/824/814/404/214/204424/414
##########################################################################

atxy4.upload.workaround=
atxy4.build.millistimer=D0
atxy4.build.bootload=
atxy4.build.board=AVR_ATtinyxy4
atxy4.upload.tool=avrdude

atxy4.bootloader.tool=avrdude
atxy4.bootloader.avrdudestring=
atxy4.bootloader.pymcuprogstring=-aerase
atxy4.build.core=megatinycore
atxy4.build.variant=txy4
atxy4.build.text_section_start=.text=0x0
atxy4.build.mcu=attiny{build.attiny}
atxy4.build.serialeventabr=
atxy4.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy4.build.f_cpu={build.speed}000000L

atxy4.menu.chip.1614=ATtiny1614
atxy4.menu.chip.1614.build.board=AVR_ATtiny1614
atxy4.menu.chip.1614.build.attiny=1614
atxy4.menu.chip.1614.upload.maximum_size=16384
atxy4.menu.chip.1614.upload.maximum_data_size=2048
atxy4.menu.chip.814=ATtiny814
atxy4.menu.chip.814.build.board=AVR_ATtiny814
atxy4.menu.chip.814.build.attiny=814
atxy4.menu.chip.814.upload.maximum_size=8192
atxy4.menu.chip.814.upload.maximum_data_size=512
atxy4.menu.chip.414=ATtiny414
atxy4.menu.chip.414.build.board=AVR_ATtiny414
atxy4.menu.chip.414.build.attiny=414
atxy4.menu.chip.414.upload.maximum_size=4096
atxy4.menu.chip.414.upload.maximum_data_size=256
atxy4.menu.chip.214=ATtiny214
atxy4.menu.chip.214.build.board=AVR_ATtiny214
atxy4.menu.chip.214.build.attiny=214
atxy4.menu.chip.214.upload.maximum_size=2048
atxy4.menu.chip.214.upload.maximum_data_size=128
atxy4.menu.chip.3224=ATtiny3224
atxy4.menu.chip.3224.build.board=AVR_ATtiny3224
atxy4.menu.chip.3224.build.millistimer=B1
atxy4.menu.chip.3224.build.attiny=3224
atxy4.menu.chip.3224.upload.maximum_size=32768
atxy4.menu.chip.3224.upload.maximum_data_size=3072
atxy4.menu.chip.1624=ATtiny1624
atxy4.menu.chip.1624.build.board=AVR_ATtiny1624
atxy4.menu.chip.1624.build.millistimer=B1
atxy4.menu.chip.1624.build.attiny=1624
atxy4.menu.chip.1624.upload.maximum_size=16384
atxy4.menu.chip.1624.upload.maximum_data_size=2048
atxy4.menu.chip.824=ATtiny824
atxy4.menu.chip.824.build.board=AVR_ATtiny824
atxy4.menu.chip.824.build.millistimer=B1
atxy4.menu.chip.824.build.attiny=824
atxy4.menu.chip.824.upload.maximum_size=8192
atxy4.menu.chip.824.upload.maximum_data_size=1024
atxy4.menu.chip.424=ATtiny424
atxy4.menu.chip.424.build.board=AVR_ATtiny424
atxy4.menu.chip.424.build.millistimer=B1
atxy4.menu.chip.424.build.attiny=424
atxy4.menu.chip.424.upload.maximum_size=4096
atxy4.menu.chip.424.upload.maximum_data_size=512
atxy4.menu.chip.1604=ATtiny1604
atxy4.menu.chip.1604.build.board=AVR_ATtiny1604
atxy4.menu.chip.1604.build.attiny=1604
atxy4.menu.chip.1604.build.millistimer=A0
atxy4.menu.chip.1604.upload.maximum_size=16384
atxy4.menu.chip.1604.upload.maximum_data_size=1024
atxy4.menu.chip.804=ATtiny804
atxy4.menu.chip.804.build.board=AVR_ATtiny804
atxy4.menu.chip.804.build.attiny=804
atxy4.menu.chip.804.build.millistimer=A0
atxy4.menu.chip.804.upload.maximum_size=8192
atxy4.menu.chip.804.upload.maximum_data_size=512
atxy4.menu.chip.404=ATtiny404
atxy4.menu.chip.404.build.board=AVR_ATtiny404
atxy4.menu.chip.404.build.attiny=404
atxy4.menu.chip.404.build.millistimer=A0
atxy4.menu.chip.404.upload.maximum_size=4096
atxy4.menu.chip.404.upload.maximum_data_size=256
atxy4.menu.chip.204=ATtiny204
atxy4.menu.chip.204.build.board=AVR_ATtiny204
atxy4.menu.chip.204.build.attiny=204
atxy4.menu.chip.204.build.millistimer=A0
atxy4.menu.chip.204.upload.maximum_size=2048
atxy4.menu.chip.204.upload.maximum_data_size=128

atxy4.menu.clock.20internal=20 MHz internal
atxy4.menu.clock.16internal=16 MHz internal
atxy4.menu.clock.10internal=10 MHz internal
atxy4.menu.clock.8internal=8 MHz internal
atxy4.menu.clock.5internal=5 MHz internal
atxy4.menu.clock.4internal=4 MHz internal
atxy4.menu.clock.1internal=1 MHz internal
atxy4.menu.clock.20extclock=20 MHz external clock
atxy4.menu.clock.16extclock=16 MHz external clock
atxy4.menu.clock.12extclock=12 MHz external clock
atxy4.menu.clock.10extclock=10 MHz external clock
atxy4.menu.clock.8extclock=8 MHz external clock
atxy4.menu.clock.24extclock=24 MHz external clock (overclocked)
atxy4.menu.clock.28extclock=28 MHz external clock (overclocked)
atxy4.menu.clock.32extclock=32 MHz external clock (overclocked)
atxy4.menu.clock.20internal.build.speed=20
atxy4.menu.clock.20internal.build.clocksource=0
atxy4.menu.clock.16internal.build.speed=16
atxy4.menu.clock.16internal.build.clocksource=0
atxy4.menu.clock.10internal.build.speed=10
atxy4.menu.clock.10internal.build.clocksource=0
atxy4.menu.clock.8internal.build.speed=8
atxy4.menu.clock.8internal.build.clocksource=0
atxy4.menu.clock.5internal.build.speed=5
atxy4.menu.clock.5internal.build.clocksource=0
atxy4.menu.clock.4internal.build.speed=4
atxy4.menu.clock.4internal.build.clocksource=0
atxy4.menu.clock.1internal.build.speed=1
atxy4.menu.clock.1internal.build.clocksource=0
atxy4.menu.clock.20extclock.build.speed=20
atxy4.menu.clock.20extclock.build.clocksource=2
atxy4.menu.clock.16extclock.build.speed=16
atxy4.menu.clock.16extclock.build.clocksource=2
atxy4.menu.clock.12extclock.build.speed=12
atxy4.menu.clock.12extclock.build.clocksource=2
atxy4.menu.clock.10extclock.build.speed=10
atxy4.menu.clock.10extclock.build.clocksource=2
atxy4.menu.clock.8extclock.build.speed=8
atxy4.menu.clock.8extclock.build.clocksource=2
atxy4.menu.clock.24extclock.build.speed=24
atxy4.menu.clock.24extclock.build.clocksource=2
atxy4.menu.clock.28extclock.build.speed=28
atxy4.menu.clock.28extclock.build.clocksource=2
atxy4.menu.clock.32extclock.build.speed=32
atxy4.menu.clock.32extclock.build.clocksource=2
atxy4.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy4.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy4.menu.clock.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy4.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy4.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy4.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy4.menu.bodvoltage.2v1=2.1V
atxy4.menu.bodvoltage.2v9=2.9V
atxy4.menu.bodvoltage.3v3=3.3V
atxy4.menu.bodvoltage.3v7=3.7V
atxy4.menu.bodvoltage.4v0=4.0V
atxy4.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy4.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy4.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy4.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy4.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy4.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy4.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy4.menu.bodvoltage.2v1.bootloader.bodlevbits=001

atxy4.menu.bodmode.disabled=Disabled/Disabled
atxy4.menu.bodmode.enabled=Enabled/Enabled
atxy4.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy4.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy4.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy4.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy4.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy4.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy4.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy4.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy4.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy4.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy4.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy4.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy4.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy4.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy4.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy4.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy4.menu.eesave.enable=EEPROM retained
atxy4.menu.eesave.enable.bootloader.eesavebit=1
atxy4.menu.eesave.disable=EEPROM not retained
atxy4.menu.eesave.disable.bootloader.eesavebit=0

atxy4.menu.millis.enabled=Enabled (default timer)
atxy4.menu.millis.disabled=Disabled (saves flash)
atxy4.menu.millis.timera=TCA0 (default on 0-series)
atxy4.menu.millis.timerd=TCD0 (1-series only, default there)
atxy4.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy4.menu.millis.timerb1=TCB1 (1614, 2-series only)
atxy4.menu.millis.rtc=RTC (no micros)
atxy4.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy4.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only no micros)
atxy4.menu.millis.disabled.build.millistimer=NONE
atxy4.menu.millis.timera.build.millistimer=A0
atxy4.menu.millis.timerd.build.millistimer=D0
atxy4.menu.millis.timerb0.build.millistimer=B0
atxy4.menu.millis.timerb1.build.millistimer=B1
atxy4.menu.millis.rtc.build.millistimer=RTC
atxy4.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy4.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

atxy4.menu.resetpin.UPDI=UPDI (no reset pin)
atxy4.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy4.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
atxy4.menu.resetpin.reset.bootloader.resetpinbits=10
atxy4.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
atxy4.menu.resetpin.gpio.bootloader.resetpinbits=00

atxy4.menu.startuptime.8=8ms
atxy4.menu.startuptime.0=0ms
atxy4.menu.startuptime.1=1ms
atxy4.menu.startuptime.2=2ms
atxy4.menu.startuptime.4=4ms
atxy4.menu.startuptime.16=16ms
atxy4.menu.startuptime.32=32ms
atxy4.menu.startuptime.64=64ms
atxy4.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy4.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy4.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy4.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy4.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy4.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy4.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy4.menu.startuptime.64.bootloader.SYSCFG1=0x07

