SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy6o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy6o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy6o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy6o.menu.bodvoltage.2v1=2.1V
atxy6o.menu.bodvoltage.2v9=2.9V
atxy6o.menu.bodvoltage.3v3=3.3V
atxy6o.menu.bodvoltage.3v7=3.7V
atxy6o.menu.bodvoltage.4v0=4.0V
atxy6o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy6o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy6o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy6o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy6o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy6o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy6o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy6o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

atxy6o.menu.bodmode.disabled=Disabled/Disabled
atxy6o.menu.bodmode.enabled=Enabled/Enabled
atxy6o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy6o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy6o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy6o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy6o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy6o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy6o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy6o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy6o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy6o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy6o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy6o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy6o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy6o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy6o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy6o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy6o.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
atxy6o.menu.uartvoltage.skip.build.uartvoltage=NA
atxy6o.menu.uartvoltage.5v=Closer to 5v
atxy6o.menu.uartvoltage.3v=Closer to 3v
atxy6o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy6o.menu.uartvoltage.3v.build.uartvoltage=3V

atxy6o.build.core=megatinycore
atxy6o.build.variant=txy6
atxy6o.build.extra_flags=-DARDUINO_attinyxy6 {build.millis} -DUARTBAUD{build.uartvoltage}
atxy6o.build.export_merged_output=true

atxy6o.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
atxy6o.menu.resetpinopti.UPDI.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}.hex
atxy6o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy6o.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
atxy6o.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}_1sec.hex
atxy6o.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
atxy6o.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atxy6o.menu.resetpinopti.reset.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}_rst.hex
atxy6o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy6o.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
atxy6o.menu.resetpinopti.gpio.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}.hex
atxy6o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

atxy6o.menu.startuptimeopti.8=8ms
atxy6o.menu.startuptimeopti.0=0ms
atxy6o.menu.startuptimeopti.1=1ms
atxy6o.menu.startuptimeopti.2=2ms
atxy6o.menu.startuptimeopti.4=4ms
atxy6o.menu.startuptimeopti.16=16ms
atxy6o.menu.startuptimeopti.32=32ms
atxy6o.menu.startuptimeopti.64=64ms
atxy6o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy6o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy6o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy6o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy6o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy6o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy6o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy6o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

atxy6o.upload.tool=avrdude

atxy6o.menu.bootloaderuart.default=TX:7 (PB2), RX:6 (PB3)
atxy6o.menu.bootloaderuart.alternate=TX:14 (PA1), RX:15 (PA2)
atxy6o.menu.bootloaderuart.default.bootloader.uartswap=
atxy6o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

atxy6o.bootloader.WDTCFG=0x00
atxy6o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy6o.bootloader.OSCCFG=0x01
atxy6o.bootloader.TCD0CFG=0x00
atxy6o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy6o.bootloader.APPEND=0x00
atxy6o.bootloader.BOOTEND=0x02

atxy6o.upload.protocol=arduino
atxy6o.upload.extra_params=-D
atxy6o.build.text_section_start=.text=0x200
atxy6o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy6o.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/{bootloader.file} -a write
atxy6o.bootloader.tool=avrdude

##########################################################################
#      ATtiny1614/1604/814/804/414/404/214/204 (Optiboot)
##########################################################################

atxy4o.upload.workaround=
atxy4o.build.millistimer=D0
atxy4o.build.bootload=opti
atxy4o.build.board=AVR_ATtinyxy4
atxy4o.build.mcu=attiny{build.attiny}
atxy4o.build.serialeventabr=
atxy4o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy4o.build.f_cpu={build.speed}000000L
atxy4o.upload.speed=115200

atxy4o.menu.chip.1614=ATtiny1614
atxy4o.menu.chip.1614.build.board=AVR_ATtiny1614
atxy4o.menu.chip.1614.build.attiny=1614
atxy4o.menu.chip.1614.upload.maximum_size=15872
atxy4o.menu.chip.1614.upload.maximum_data_size=2048
atxy4o.menu.chip.1604=ATtiny1604
atxy4o.menu.chip.1604.build.board=AVR_ATtiny1604
atxy4o.menu.chip.1604.build.attiny=1604
atxy4o.menu.chip.1604.build.millistimer=A0
atxy4o.menu.chip.1604.upload.maximum_size=15872
atxy4o.menu.chip.1604.upload.maximum_data_size=1024
atxy4o.menu.chip.814=ATtiny814
atxy4o.menu.chip.814.build.board=AVR_ATtiny814
atxy4o.menu.chip.814.build.attiny=814
atxy4o.menu.chip.814.upload.maximum_size=7680
atxy4o.menu.chip.814.upload.maximum_data_size=512
atxy4o.menu.chip.804=ATtiny804
atxy4o.menu.chip.804.build.board=AVR_ATtiny804
atxy4o.menu.chip.804.build.attiny=804
atxy4o.menu.chip.804.build.millistimer=A0
atxy4o.menu.chip.804.upload.maximum_size=7680
atxy4o.menu.chip.804.upload.maximum_data_size=512
atxy4o.menu.chip.414=ATtiny414
atxy4o.menu.chip.414.build.board=AVR_ATtiny414
atxy4o.menu.chip.414.build.attiny=414
atxy4o.menu.chip.414.upload.maximum_size=3584
atxy4o.menu.chip.414.upload.maximum_data_size=256
atxy4o.menu.chip.404=ATtiny404
atxy4o.menu.chip.404.build.board=AVR_ATtiny404
atxy4o.menu.chip.404.build.attiny=404
atxy4o.menu.chip.404.build.millistimer=A0
atxy4o.menu.chip.404.upload.maximum_size=3584
atxy4o.menu.chip.404.upload.maximum_data_size=256
atxy4o.menu.chip.214=ATtiny214
atxy4o.menu.chip.214.build.board=AVR_ATtiny214
atxy4o.menu.chip.214.build.attiny=214
atxy4o.menu.chip.214.upload.maximum_size=1536
atxy4o.menu.chip.214.upload.maximum_data_size=128
atxy4o.menu.chip.204=ATtiny204
atxy4o.menu.chip.204.build.board=AVR_ATtiny204
atxy4o.menu.chip.204.build.attiny=204
atxy4o.menu.chip.204.build.millistimer=A0
atxy4o.menu.chip.204.upload.maximum_size=1536
atxy4o.menu.chip.204.upload.maximum_data_size=128

atxy4o.menu.clocko.20internal=20 MHz internal
atxy4o.menu.clocko.16internal=16 MHz internal
atxy4o.menu.clocko.10internal=10 MHz internal
atxy4o.menu.clocko.8internal=8 MHz internal
atxy4o.menu.clocko.5internal=5 MHz internal
atxy4o.menu.clocko.4internal=4 MHz internal
atxy4o.menu.clocko.1internal=1 MHz internal
atxy4o.menu.clocko.20extclock=20 MHz external clock
atxy4o.menu.clocko.16extclock=16 MHz external clock
atxy4o.menu.clocko.12extclock=12 MHz external clock
atxy4o.menu.clocko.10extclock=10 MHz external clock
atxy4o.menu.clocko.8extclock=8 MHz external clock
atxy4o.menu.clocko.24extclock=24 MHz external clock (overclocked)
atxy4o.menu.clocko.28extclock=28 MHz external clock (overclocked)
atxy4o.menu.clocko.32extclock=32 MHz external clock (overclocked)
atxy4o.menu.clocko.20internal.build.speed=20
atxy4o.menu.clocko.20internal.build.clocksource=0
atxy4o.menu.clocko.16internal.build.speed=16
atxy4o.menu.clocko.16internal.build.clocksource=0
atxy4o.menu.clocko.10internal.build.speed=10
atxy4o.menu.clocko.10internal.build.clocksource=0
atxy4o.menu.clocko.8internal.build.speed=8
atxy4o.menu.clocko.8internal.build.clocksource=0
atxy4o.menu.clocko.5internal.build.speed=5
atxy4o.menu.clocko.5internal.build.clocksource=0
atxy4o.menu.clocko.4internal.build.speed=4
atxy4o.menu.clocko.4internal.build.clocksource=0
atxy4o.menu.clocko.1internal.build.speed=1
atxy4o.menu.clocko.1internal.build.clocksource=0
atxy4o.menu.clocko.20extclock.build.speed=20
atxy4o.menu.clocko.20extclock.build.clocksource=2
atxy4o.menu.clocko.16extclock.build.speed=16
atxy4o.menu.clocko.16extclock.build.clocksource=2
atxy4o.menu.clocko.12extclock.build.speed=12
atxy4o.menu.clocko.12extclock.build.clocksource=2
atxy4o.menu.clocko.10extclock.build.speed=10
atxy4o.menu.clocko.10extclock.build.clocksource=2
atxy4o.menu.clocko.8extclock.build.speed=8
atxy4o.menu.clocko.8extclock.build.clocksource=2
atxy4o.menu.clocko.24extclock.build.speed=24
atxy4o.menu.clocko.24extclock.build.clocksource=2
atxy4o.menu.clocko.28extclock.build.speed=28
atxy4o.menu.clocko.28extclock.build.clocksource=2
atxy4o.menu.clocko.32extclock.build.speed=32
atxy4o.menu.clocko.32extclock.build.clocksource=2
atxy4o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.5internal.bootloader.OSCCFG=0x02
# all others are handled by the default of 16 MHz

atxy4o.menu.millis.enabled=Enabled (default timer)
atxy4o.menu.millis.disabled=Disabled (saves flash)
atxy4o.menu.millis.timera=TCA0 (default on 0-series)
atxy4o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy4o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy4o.menu.millis.timerb1=TCB1 (1614 only)
atxy4o.menu.millis.rtc=RTC (no micros)
atxy4o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1-series only, no micros)
atxy4o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1-series only, no micros)
atxy4o.menu.millis.disabled.build.millistimer=NONE
atxy4o.menu.millis.timera.build.millistimer=A0
atxy4o.menu.millis.timerd.build.millistimer=D0
atxy4o.menu.millis.timerb0.build.millistimer=B0
atxy4o.menu.millis.timerb1.build.millistimer=B1
atxy4o.menu.millis.rtc.build.millistimer=RTC
atxy4o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy4o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

atxy4o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy4o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy4o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy4o.menu.bodvoltage.2v1=2.1V
atxy4o.menu.bodvoltage.2v9=2.9V
atxy4o.menu.bodvoltage.3v3=3.3V
atxy4o.menu.bodvoltage.3v7=3.7V
atxy4o.menu.bodvoltage.4v0=4.0V
atxy4o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy4o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy4o.menu.bodvoltage.4v2.bootloader.bodlevbits=111
atxy4o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy4o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy4o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy4o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy4o.menu.bodvoltage.2v1.bootloader.bodlevbits=001

atxy4o.menu.bodmode.disabled=Disabled/Disabled
atxy4o.menu.bodmode.enabled=Enabled/Enabled
atxy4o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy4o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy4o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy4o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy4o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy4o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy4o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy4o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy4o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy4o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy4o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy4o.menu.bodmode.samplefast.bootloader.bodmodebits=01010
atxy4o.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
atxy4o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy4o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy4o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

atxy4o.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
atxy4o.menu.uartvoltage.skip.build.uartvoltage=NA
atxy4o.menu.uartvoltage.5v=Closer to 5v
atxy4o.menu.uartvoltage.5v.build.uartvoltage=5V
atxy4o.menu.uartvoltage.3v=Closer to 3v
atxy4o.menu.uartvoltage.3v.build.uartvoltage=3V

atxy4o.upload.tool=avrdude

atxy4o.build.core=megatinycore
atxy4o.build.variant=txy4
atxy4o.build.extra_flags=-DARDUINO_attinyxy4 {build.millis} -DUARTBAUD{build.uartvoltage}
atxy4o.build.export_merged_output=true

atxy4o.upload.protocol=arduino
atxy4o.upload.extra_params=-D
atxy4o.build.text_section_start=.text=0x200
atxy4o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy4o.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/{bootloader.file} -a write
atxy4o.bootloader.tool=avrdude

atxy4o.menu.bootloaderuart.default=TX:5 (PB2), RX:4 (PB3)
atxy4o.menu.bootloaderuart.alternate=TX:8 (PA1), RX:9 (PA2)
atxy4o.menu.bootloaderuart.default.bootloader.uartswap=
atxy4o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

atxy4o.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
atxy4o.menu.resetpinopti.UPDI.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}.hex
atxy4o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy4o.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
atxy4o.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}_1sec.hex
atxy4o.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
atxy4o.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atxy4o.menu.resetpinopti.reset.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}_rst.hex
atxy4o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy4o.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
atxy4o.menu.resetpinopti.gpio.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}.hex
atxy4o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

atxy4o.menu.startuptimeopti.8=8ms
atxy4o.menu.startuptimeopti.0=0ms
atxy4o.menu.startuptimeopti.1=1ms
atxy4o.menu.startuptimeopti.2=2ms
atxy4o.menu.startuptimeopti.4=4ms
atxy4o.menu.startuptimeopti.16=16ms
atxy4o.menu.startuptimeopti.32=32ms
atxy4o.menu.startuptimeopti.64=64ms
atxy4o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy4o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy4o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy4o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy4o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy4o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy4o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy4o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

atxy4o.bootloader.WDTCFG=0x00
atxy4o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy4o.bootloader.OSCCFG=0x01
atxy4o.bootloader.TCD0CFG=0x00
atxy4o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy4o.bootloader.APPEND=0x00
atxy4o.bootloader.BOOTEND=0x02

##########################################################################
#      ATtiny412/402/212/202 (Optiboot)
##########################################################################

atxy2o.upload.workaround=
atxy2o.build.millistimer=D0
atxy2o.build.bootload=opti
atxy2o.build.board=AVR_ATtinyxy2
atxy2o.build.mcu=attiny{build.attiny}
atxy2o.build.serialeventabr=
atxy2o.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
atxy2o.build.f_cpu={build.speed}000000L
atxy2o.upload.speed=115200

atxy2o.menu.chip.412=ATtiny412
atxy2o.menu.chip.412.build.board=AVR_ATtiny412
atxy2o.menu.chip.412.build.attiny=412
atxy2o.menu.chip.412.upload.maximum_size=3584
atxy2o.menu.chip.412.upload.maximum_data_size=256
atxy2o.menu.chip.212=ATtiny212
atxy2o.menu.chip.212.build.board=AVR_ATtiny212
atxy2o.menu.chip.212.build.attiny=212
atxy2o.menu.chip.212.upload.maximum_size=1536
atxy2o.menu.chip.212.upload.maximum_data_size=128
atxy2o.menu.chip.402=ATtiny402
atxy2o.menu.chip.402.build.board=AVR_ATtiny402
atxy2o.menu.chip.402.build.attiny=402
atxy2o.menu.chip.402.build.millistimer=A0
atxy2o.menu.chip.402.upload.maximum_size=3584
atxy2o.menu.chip.402.upload.maximum_data_size=256
atxy2o.menu.chip.402w=ATtiny402 (bad signature)
atxy2o.menu.chip.402w.build.attiny=402
atxy2o.menu.chip.402w.build.board=AVR_ATtiny402
atxy2o.menu.chip.402w.build.millistimer=A0
atxy2o.menu.chip.402w.upload.maximum_size=3584
atxy2o.menu.chip.402w.upload.maximum_data_size=256
atxy2o.menu.chip.402w.upload.workaround=w
atxy2o.menu.chip.202=ATtiny202
atxy2o.menu.chip.202.build.board=AVR_ATtiny202
atxy2o.menu.chip.202.build.attiny=202
atxy2o.menu.chip.202.build.millistimer=A0
atxy2o.menu.chip.202.upload.maximum_size=1536
atxy2o.menu.chip.202.upload.maximum_data_size=128

