SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy2o.bootloader.WDTCFG=0x00
atxy2o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2o.bootloader.OSCCFG=0x01
atxy2o.bootloader.TCD0CFG=0x00
atxy2o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy2o.bootloader.APPEND=0x00
atxy2o.bootloader.BOOTEND=0x02

##########################################################################
#      ATtiny3227/1627/827/427 (Optiboot)
##########################################################################

#atxy7o.menu.chip.3227=ATtiny3227
#atxy7o.menu.chip.3227.build.board=AVR_ATtiny3227
#atxy7o.menu.chip.3227.bootloader.altreset=11
#atxy7o.menu.chip.3227.build.millistimer=B1
#atxy7o.menu.chip.3227.build.attiny=3227
#atxy7o.menu.chip.3227.upload.maximum_size=32256
#atxy7o.menu.chip.3227.upload.maximum_data_size=3072
#atxy7o.menu.chip.1627=ATtiny1627
#atxy7o.menu.chip.1627.bootloader.altreset=11
#atxy7o.menu.chip.1627.build.board=AVR_ATtiny1627
#atxy7o.menu.chip.1627.build.millistimer=B1
#atxy7o.menu.chip.1627.build.attiny=1627
#atxy7o.menu.chip.1627.upload.maximum_size=15872
#atxy7o.menu.chip.1627.upload.maximum_data_size=2048
#atxy7o.menu.chip.827=ATtiny827
#atxy7o.menu.chip.827.bootloader.altreset=11
#atxy7o.menu.chip.827.build.board=AVR_ATtiny827
#atxy7o.menu.chip.827.build.millistimer=B1
#atxy7o.menu.chip.827.build.attiny=827
#atxy7o.menu.chip.827.upload.maximum_size=7680
#atxy7o.menu.chip.827.upload.maximum_data_size=1024
#atxy7o.menu.chip.427=ATtiny427
#atxy7o.menu.chip.427.bootloader.altreset=11
#atxy7o.menu.chip.427.build.board=AVR_ATtiny427
#atxy7o.menu.chip.427.build.millistimer=B1
#atxy7o.menu.chip.427.build.attiny=427
#atxy7o.menu.chip.427.upload.maximum_size=3584
#atxy7o.menu.chip.427.upload.maximum_data_size=512

#atxy7o.menu.resetpinopti.UPDIaltrst=UPDI w/reset on PB4 (2-series only, Optiboot for 1 sec after reset)
#atxy7o.menu.resetpinopti.UPDIaltrst.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}_rst.hex
#atxy7o.menu.resetpinopti.UPDIaltrst.bootloader.resetpinbits={bootloader.altreset}

##########################################################################
#      ATtiny3226/1626/826/426 (Optiboot)
##########################################################################

#atxy6o.menu.chip.3226=ATtiny3226
#atxy6o.menu.chip.3226.bootloader.altreset=11
#atxy6o.menu.chip.3226.build.board=AVR_ATtiny3226
#atxy6o.menu.chip.3226.build.millistimer=B1
#atxy6o.menu.chip.3226.build.attiny=3226
#atxy6o.menu.chip.3226.upload.maximum_size=32256
#atxy6o.menu.chip.3226.upload.maximum_data_size=3072
#atxy6o.menu.chip.1626=ATtiny1626
#atxy6o.menu.chip.1626.bootloader.altreset=11
#atxy6o.menu.chip.1626.build.board=AVR_ATtiny1626
#atxy6o.menu.chip.1626.build.millistimer=B1
#atxy6o.menu.chip.1626.build.attiny=1626
#atxy6o.menu.chip.1626.upload.maximum_size=15872
#atxy6o.menu.chip.1626.upload.maximum_data_size=2048
#atxy6o.menu.chip.826=ATtiny826
#atxy6o.menu.chip.826.bootloader.altreset=11
#atxy6o.menu.chip.826.build.board=AVR_ATtiny826
#atxy6o.menu.chip.826.build.millistimer=B1
#atxy6o.menu.chip.826.build.attiny=826
#atxy6o.menu.chip.826.upload.maximum_size=7680
#atxy6o.menu.chip.826.upload.maximum_data_size=1024
#atxy6o.menu.chip.426=ATtiny426
#atxy6o.menu.chip.426.bootloader.altreset=11
#atxy6o.menu.chip.426.build.board=AVR_ATtiny426
#atxy6o.menu.chip.426.build.millistimer=B1
#atxy6o.menu.chip.426.build.attiny=426
#atxy6o.menu.chip.426.upload.maximum_size=3584
#atxy6o.menu.chip.426.upload.maximum_data_size=512


#atx26o.menu.resetpinopti.UPDIaltrst=UPDI w/reset on PB4 (2-series only, Optiboot for 1 sec after reset)
#atx26o.menu.resetpinopti.UPDIaltrst.bootloader.file=optiboot_x/optiboot_txyz{bootloader.uartswap}_rst.hex
#atx26o.menu.resetpinopti.UPDIaltrst.bootloader.resetpinbits={bootloader.altreset}


##########################################################################
#      ATtiny3224/1624/824/424 (Optiboot)
##########################################################################

#atxy4o.menu.chip.3224=ATtiny3224
#atxy4o.menu.chip.3224.build.board=AVR_ATtiny3224
#atxy4o.menu.chip.3224.build.millistimer=B1
#atxy4o.menu.chip.3224.build.attiny=3224
#atxy4o.menu.chip.3224.upload.maximum_size=15872
#atxy4o.menu.chip.3224.upload.maximum_data_size=3072
#atxy4o.menu.chip.1624=ATtiny1624
#atxy4o.menu.chip.1624.build.board=AVR_ATtiny1624
#atxy4o.menu.chip.1624.build.millistimer=B1
#atxy4o.menu.chip.1624.build.attiny=1624
#atxy4o.menu.chip.1624.upload.maximum_size=15872
#atxy4o.menu.chip.1624.upload.maximum_data_size=2048
#atxy4o.menu.chip.824=ATtiny824
#atxy4o.menu.chip.824.build.board=AVR_ATtiny824
#atxy4o.menu.chip.824.build.millistimer=B1
#atxy4o.menu.chip.824.build.attiny=824
#atxy4o.menu.chip.824.upload.maximum_size=7680
#atxy4o.menu.chip.824.upload.maximum_data_size=1024
#atxy4o.menu.chip.424=ATtiny424
#atxy4o.menu.chip.424.build.board=AVR_ATtiny424
#atxy4o.menu.chip.424.build.millistimer=B1
#atxy4o.menu.chip.424.build.attiny=424
#atxy4o.menu.chip.424.upload.maximum_size=3584
#atxy4o.menu.chip.424.upload.maximum_data_size=512

##########################################################################
#      Attiny416 Xplained Nano (Optiboot)
##########################################################################

Xplained416.upload.workaround=
Xplained416.build.millistimer=D0
Xplained416.build.bootload=opti
Xplained416.build.mcu=attiny{build.attiny}
Xplained416.build.serialeventabr=
Xplained416.build.millis=-DMILLIS_USE_TIMER{build.millistimer}
Xplained416.build.f_cpu={build.speed}000000L

Xplained416.build.attiny=416
Xplained416.build.board=AVR_Xplained416
Xplained416.build.core=megatinycore
Xplained416.build.variant=txy6
Xplained416.build.speed=20
Xplained416.build.clocksource=0
Xplained416.build.text_section_start=.text=0x200
Xplained416.build.extra_flags=-DARDUINO_attinyxy6 -DARDUINO_AVR_ATtiny416 {build.millis} -DUARTBAUD5V

Xplained416.upload.tool=avrdude
Xplained416.upload.speed=57600
Xplained416.upload.maximum_size=3584
Xplained416.upload.maximum_data_size=256
Xplained416.upload.protocol=arduino
Xplained416.upload.extra_params=-D
Xplained416.bootloader.file=optiboot_x/optiboot_xplained416.hex
Xplained416.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained416.bootloader.pymcuprogstring=-f{runtime.platform.path}/bootloaders/{bootloader.file} -a write
Xplained416.bootloader.tool=avrdude
Xplained416.bootloader.BOOTEND=0x2
Xplained416.bootloader.OSCCFG=0x02
Xplained416.bootloader.WDTCFG=0x00
Xplained416.bootloader.BODCFG=0b00000000
Xplained416.bootloader.TCD0CFG=0x00
Xplained416.bootloader.SYSCFG0=0xC9
Xplained416.bootloader.SYSCFG1=0x07
Xplained416.bootloader.APPEND=0x00

